graph(%self.1 : __torch__.vad.model.vad_annotator.VADRNNJITMerge,
      %x.1 : Tensor,
      %sr.1 : int):
  %3 : str = prim::Constant[value="builtins.ValueError"]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:381:18
  %4 : str = prim::Constant[value=""]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:381:18
  %5 : bool = prim::Constant[value=0]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:371:12
  %6 : int = prim::Constant[value=0]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:373:73
  %7 : int = prim::Constant[value=16000]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:376:17
  %8 : int = prim::Constant[value=8000]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:378:19
  %9 : int = prim::Constant[value=1]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:384:46
  %10 : Tensor = prim::Uninitialized() # :0:0
  %49 : float = prim::Constant[value=31.25]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:363:29
  %50 : int = prim::Constant[value=16000]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:355:17
  %51 : int = prim::Constant[value=2]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:352:21
  %52 : int = prim::Constant[value=0]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:351:28
  %53 : int = prim::Constant[value=1]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:350:22
  %54 : str = prim::Constant[value="Too many dimensions for input audio chunk {}"]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:353:29
  %55 : str = prim::Constant[value="Supported sampling rates: {} (or multiply of 16000)"]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:361:29
  %56 : str = prim::Constant[value="builtins.ValueError"]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:353:18
  %57 : bool = prim::Constant[value=0]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:355:11
  %58 : NoneType = prim::Constant() # :0:0
  %59 : str = prim::Constant[value="Input audio chunk is too short"]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:364:29
  %60 : int = aten::dim(%x.1) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:350:11
  %61 : bool = aten::eq(%60, %53) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:350:11
  %x1 : Tensor = prim::If(%61) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:350:8
    block0():
      %x1.3 : Tensor = aten::unsqueeze(%x.1, %52) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:351:16
      -> (%x1.3)
    block1():
      -> (%x.1)
  %64 : int = aten::dim(%x1) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:352:11
  %65 : bool = aten::gt(%64, %51) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:352:11
   = prim::If(%65) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:352:8
    block0():
      %66 : int = aten::dim(%x1) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:353:74
      %67 : str = aten::format(%54, %66) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:353:29
       = prim::RaiseException(%67, %56) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:353:12
      -> ()
    block1():
      -> ()
  %68 : bool = aten::ne(%sr.1, %50) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:355:11
  %69 : bool = prim::If(%68) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:355:11
    block0():
      %70 : int = aten::remainder(%sr.1, %50) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:355:28
      %71 : bool = aten::eq(%70, %52) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:355:28
      -> (%71)
    block1():
      -> (%57)
  %sr1 : int, %x2 : Tensor = prim::If(%69) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:355:8
    block0():
      %step.1 : int = aten::floordiv(%sr.1, %50) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:356:19
      %x3.2 : Tensor = aten::slice(%x1, %52, %58, %58, %step.1) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:357:16
      -> (%50, %x3.2)
    block1():
      -> (%sr.1, %x1)
  %sample_rates.1 : int[] = prim::GetAttr[name="sample_rates"](%self.1)
  %77 : bool = aten::__contains__(%sample_rates.1, %sr1) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:360:11
  %78 : bool = aten::__not__(%77) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:360:11
   = prim::If(%78) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:360:8
    block0():
      %sample_rates : int[] = prim::GetAttr[name="sample_rates"](%self.1)
      %80 : str = aten::format(%55, %sample_rates) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:361:29
       = prim::RaiseException(%80, %56) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:361:12
      -> ()
    block1():
      -> ()
  %81 : int[] = aten::size(%x2) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:363:16
  %82 : int = aten::__getitem__(%81, %53) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:363:16
  %83 : float = aten::div(%sr1, %82) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:363:11
  %84 : bool = aten::gt(%83, %49) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:363:11
   = prim::If(%84) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:363:8
    block0():
       = prim::RaiseException(%59, %56) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:364:12
      -> ()
    block1():
      -> ()
  %85 : (Tensor, int) = prim::TupleConstruct(%x2, %sr1)
  %x0.3 : Tensor, %sr0.1 : int = prim::TupleUnpack(%85)
  %_last_sr.1 : int = prim::GetAttr[name="_last_sr"](%self.1)
  %15 : bool = aten::Bool(%_last_sr.1) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:371:12
  %16 : bool = prim::If(%15) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:371:12
    block0():
      %_last_sr : int = prim::GetAttr[name="_last_sr"](%self.1)
      %18 : bool = aten::ne(%_last_sr, %sr0.1) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:371:32
      -> (%18)
    block1():
      -> (%5)
   = prim::If(%16) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:371:8
    block0():
      %86 : int = prim::Constant[value=0]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:343:30
      %87 : NoneType = prim::Constant()
      %88 : int[] = prim::ListConstruct(%86)
      %89 : Tensor = aten::zeros(%88, %87, %87, %87, %87) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:343:18
       = prim::SetAttr[name="_h"](%self.1, %89)
      %90 : int[] = prim::ListConstruct(%86)
      %91 : Tensor = aten::zeros(%90, %87, %87, %87, %87) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:344:18
       = prim::SetAttr[name="_c"](%self.1, %91)
       = prim::SetAttr[name="_last_sr"](%self.1, %86)
       = prim::SetAttr[name="_last_batch_size"](%self.1, %86)
      -> ()
    block1():
      -> ()
  %_last_batch_size.1 : int = prim::GetAttr[name="_last_batch_size"](%self.1)
  %21 : bool = aten::Bool(%_last_batch_size.1) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:373:12
  %22 : bool = prim::If(%21) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:373:12
    block0():
      %_last_batch_size : int = prim::GetAttr[name="_last_batch_size"](%self.1)
      %24 : int[] = aten::size(%x0.3) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:373:65
      %25 : int = aten::__getitem__(%24, %6) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:373:65
      %26 : bool = aten::ne(%_last_batch_size, %25) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:373:40
      -> (%26)
    block1():
      -> (%5)
   = prim::If(%22) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:373:8
    block0():
      %92 : int = prim::Constant[value=0]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:343:30
      %93 : NoneType = prim::Constant()
      %94 : int[] = prim::ListConstruct(%92)
      %95 : Tensor = aten::zeros(%94, %93, %93, %93, %93) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:343:18
       = prim::SetAttr[name="_h"](%self.1, %95)
      %96 : int[] = prim::ListConstruct(%92)
      %97 : Tensor = aten::zeros(%96, %93, %93, %93, %93) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:344:18
       = prim::SetAttr[name="_c"](%self.1, %97)
       = prim::SetAttr[name="_last_sr"](%self.1, %92)
       = prim::SetAttr[name="_last_batch_size"](%self.1, %92)
      -> ()
    block1():
      -> ()
  %28 : bool = aten::eq(%sr0.1, %7) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:376:11
  %out : Tensor = prim::If(%28) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:376:8
    block0():
      %_model.1 : __torch__.vad.model.vad_annotator.___torch_mangle_28.VADRNNJIT = prim::GetAttr[name="_model"](%self.1)
      %_h.1 : Tensor = prim::GetAttr[name="_h"](%self.1)
      %_c.1 : Tensor = prim::GetAttr[name="_c"](%self.1)
      %98 : str = prim::Constant[value="Expected hidden[1] size {}, got {}"]() # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/rnn.py:696:31
      %99 : str = prim::Constant[value="Expected hidden[0] size {}, got {}"]() # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/rnn.py:694:31
      %100 : str = prim::Constant[value="input must have {} dimensions, got {}"]() # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/rnn.py:202:16
      %101 : str = prim::Constant[value="input.size(-1) must be equal to input_size. Expected {}, got {}"]() # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/rnn.py:206:16
      %102 : int = prim::Constant[value=64]() # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/rnn.py:741:73
      %103 : int = prim::Constant[value=3]() # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/rnn.py:731:40
      %104 : str = prim::Constant[value="For batched 3-D input, hx and cx should also be 3-D but got ({}-D, {}-D) tensors"]() # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/rnn.py:753:31
      %105 : str = prim::Constant[value="For unbatched 2-D input, hx and cx should also be 2-D but got ({}-D, {}-D) tensors"]() # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/rnn.py:758:31
      %106 : str = prim::Constant[value="builtins.RuntimeError"]() # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/rnn.py:755:30
      %107 : str = prim::Constant[value="Expected more than 1 value per channel when training, got input size {}"]() # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2404:25
      %108 : str = prim::Constant[value="builtins.ValueError"]() # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/batchnorm.py:298:18
      %109 : float = prim::Constant[value=1.0000000000000001e-05]() # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/batchnorm.py:179:12
      %110 : float = prim::Constant[value=0.10000000000000001]() # :0:0
      %111 : int = prim::Constant[value=16]() # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/conv.py:304:53
      %112 : int = prim::Constant[value=32]() # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/conv.py:304:53
      %113 : int = prim::Constant[value=258]() # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/conv.py:304:53
      %114 : float = prim::Constant[value=0.14999999999999999]() # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/dropout.py:58:32
      %115 : int[] = prim::Constant[value=[0]]()
      %116 : Function = prim::Constant[name="simple_pad"]()
      %117 : bool = prim::Constant[value=1]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:409:41
      %118 : int = prim::Constant[value=1048576]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:406:36
      %119 : int = prim::Constant[value=-1]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:412:34
      %120 : int = prim::Constant[value=0]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:38:43
      %121 : int = prim::Constant[value=6]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:57:20
      %122 : int = prim::Constant[value=2]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:46:62
      %123 : str = prim::Constant[value="reflect"]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:47:81
      %124 : int[] = prim::Constant[value=[1]]()
      %125 : int = prim::Constant[value=1]() # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:294:40
      %126 : bool = prim::Constant[value=0]()
      %127 : NoneType = prim::Constant()
      %feature_extractor.2 : __torch__.vad.utils.pytorch_stft.STFT = prim::GetAttr[name="feature_extractor"](%_model.1)
      %num_batches.2 : int = aten::size(%x0.3, %120) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:41:22
      %num_samples.2 : int = aten::size(%x0.3, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:42:22
      %131 : int[] = prim::ListConstruct(%num_batches.2, %125, %num_samples.2)
      %input_data0.2 : Tensor = aten::view(%x0.3, %131) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:44:21
      %filter_length.2 : int = prim::GetAttr[name="filter_length"](%feature_extractor.2)
      %hop_length.2 : int = prim::GetAttr[name="hop_length"](%feature_extractor.2)
      %135 : int = aten::sub(%filter_length.2, %hop_length.2) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:46:22
      %136 : float = aten::div(%135, %122) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:46:22
      %to_pad.3 : int = aten::Int(%136) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:46:17
      %138 : Tensor = aten::unsqueeze(%input_data0.2, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:47:27
      %139 : int[] = prim::ListConstruct(%to_pad.3, %to_pad.3, %120, %120)
      %input_data1.2 : Tensor = aten::pad(%138, %139, %123, %127) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:47:21
      %input_data2.2 : Tensor = aten::squeeze(%input_data1.2, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:48:21
      %forward_basis_buffer.2 : Tensor = prim::GetAttr[name="forward_basis_buffer"](%feature_extractor.2)
      %hop_length.4 : int = prim::GetAttr[name="hop_length"](%feature_extractor.2)
      %144 : int[] = prim::ListConstruct(%hop_length.4)
      %145 : int[] = prim::ListConstruct(%120)
      %forward_transform.2 : Tensor = aten::conv1d(%input_data2.2, %forward_basis_buffer.2, %127, %144, %145, %124, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:50:28
      %filter_length.4 : int = prim::GetAttr[name="filter_length"](%feature_extractor.2)
      %148 : float = aten::div(%filter_length.4, %122) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:56:22
      %149 : float = aten::add(%148, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:56:22
      %cutoff.2 : int = aten::Int(%149) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:56:17
      %151 : Tensor = aten::slice(%forward_transform.2, %120, %127, %127, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:57:20
      %152 : Tensor = aten::slice(%151, %125, %127, %cutoff.2, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:57:20
      %153 : Tensor = aten::slice(%152, %122, %127, %127, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:57:20
      %real_part.2 : Tensor = aten::to(%153, %121, %126, %126, %127) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:57:20
      %155 : Tensor = aten::slice(%forward_transform.2, %120, %127, %127, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:58:20
      %156 : Tensor = aten::slice(%155, %125, %cutoff.2, %127, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:58:20
      %157 : Tensor = aten::slice(%156, %122, %127, %127, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:58:20
      %imag_part.2 : Tensor = aten::to(%157, %121, %126, %126, %127) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:58:20
      %159 : Tensor = aten::pow(%real_part.2, %122) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:60:31
      %160 : Tensor = aten::pow(%imag_part.2, %122) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:60:46
      %161 : Tensor = aten::add(%159, %160, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:60:31
      %magnitude.2 : Tensor = aten::sqrt(%161) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:60:20
      %163 : Tensor = prim::data(%imag_part.2) # :0:0
      %164 : Tensor = prim::data(%real_part.2) # :0:0
      %phase.2 : Tensor = aten::atan2(%163, %164) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/utils/pytorch_stft.py:61:16
      %166 : (Tensor, Tensor) = prim::TupleConstruct(%magnitude.2, %phase.2)
      %x0.7 : Tensor = prim::TupleIndex(%166, %120)
      %adaptive_normalization.2 : __torch__.models.stt_model_blocks.AdaptiveAudioNormalizationNew = prim::GetAttr[name="adaptive_normalization"](%_model.1)
      %169 : Tensor = aten::mul(%x0.7, %118) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:406:28
      %spect0.2 : Tensor = aten::log1p(%169) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:406:16
      %171 : int[] = aten::size(%spect0.2) # <string>:13:9
      %172 : int = aten::len(%171) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:407:11
      %173 : bool = aten::eq(%172, %122) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:407:11
      %spect1.2 : Tensor = prim::If(%173) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:407:8
        block0():
          %175 : Tensor = aten::unsqueeze(%spect0.2, %120) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:408:20
          %176 : Tensor = aten::slice(%175, %125, %127, %127, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:408:20
          %spect1.4 : Tensor = aten::slice(%176, %122, %127, %127, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:408:20
          -> (%spect1.4)
        block1():
          -> (%spect0.2)
      %178 : int[] = prim::ListConstruct(%125)
      %mean.2 : Tensor = aten::mean(%spect1.2, %178, %117, %127) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:409:15
      %to_pad.5 : int = prim::GetAttr[name="to_pad"](%adaptive_normalization.2)
      %181 : Tensor = aten::slice(%mean.2, %120, %127, %127, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:392:26
      %182 : Tensor = aten::slice(%181, %125, %127, %127, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:392:26
      %183 : int = aten::add(%to_pad.5, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:392:37
      %184 : Tensor = aten::slice(%182, %122, %125, %183, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:392:26
      %185 : int[] = prim::ListConstruct(%119)
      %left_pad.2 : Tensor = aten::flip(%184, %185) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:392:15
      %187 : Tensor = aten::slice(%mean.2, %120, %127, %127, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:393:27
      %188 : Tensor = aten::slice(%187, %125, %127, %127, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:393:27
      %189 : int = aten::sub(%119, %to_pad.5) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:393:35
      %190 : Tensor = aten::slice(%188, %122, %189, %119, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:393:27
      %191 : int[] = prim::ListConstruct(%119)
      %right_pad.2 : Tensor = aten::flip(%190, %191) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:393:16
      %193 : Tensor[] = prim::ListConstruct(%left_pad.2, %mean.2, %right_pad.2)
      %mean0.2 : Tensor = aten::cat(%193, %122) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:394:11
      %filter_.2 : Tensor = prim::GetAttr[name="filter_"](%adaptive_normalization.2)
      %mean1.2 : Tensor = aten::conv1d(%mean0.2, %filter_.2, %127, %124, %115, %124, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:411:15
      %197 : int[] = prim::ListConstruct(%119)
      %mean_mean.2 : Tensor = aten::mean(%mean1.2, %197, %117, %127) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:412:20
      %199 : Tensor = aten::neg(%mean_mean.2) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:413:26
      %norm.2 : Tensor = aten::add(%spect1.2, %199, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/stt_model_blocks.py:413:16
      %201 : Tensor[] = prim::ListConstruct(%x0.7, %norm.2)
      %x1.7 : Tensor = aten::cat(%201, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/vad/model/vad_annotator.py:294:12
      %first_layer.2 : __torch__.torch.nn.modules.container.___torch_mangle_2.Sequential = prim::GetAttr[name="first_layer"](%_model.1)
      %_0.10 : __torch__.models.number_vad_model.ConvBlock = prim::GetAttr[name="0"](%first_layer.2)
      %_1.7 : __torch__.torch.nn.modules.dropout.Dropout = prim::GetAttr[name="1"](%first_layer.2)
      %pw_conv.5 : __torch__.torch.nn.modules.container.___torch_mangle_1.Sequential = prim::GetAttr[name="pw_conv"](%_0.10)
      %dw_conv.5 : __torch__.torch.nn.modules.container.Sequential = prim::GetAttr[name="dw_conv"](%_0.10)
      %_0.12 : __torch__.torch.nn.modules.conv.Conv1d = prim::GetAttr[name="0"](%dw_conv.5)
      %_1.9 : __torch__.torch.nn.modules.linear.Identity = prim::GetAttr[name="1"](%dw_conv.5)
      %_2.1 : __torch__.torch.nn.modules.activation.ReLU = prim::GetAttr[name="2"](%dw_conv.5)
      %weight.11 : Tensor = prim::GetAttr[name="weight"](%_0.12)
      %bias.11 : Tensor? = prim::GetAttr[name="bias"](%_0.12)
      %213 : int[] = prim::ListConstruct(%125)
      %214 : int[] = prim::ListConstruct(%122)
      %215 : int[] = prim::ListConstruct(%125)
      %input1.3 : Tensor = aten::conv1d(%x1.7, %weight.11, %bias.11, %213, %214, %215, %113) # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/conv.py:303:15
      %result.8 : Tensor = aten::relu(%input1.3) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:1457:17
      %_0.14 : __torch__.torch.nn.modules.conv.___torch_mangle_0.Conv1d = prim::GetAttr[name="0"](%pw_conv.5)
      %_1.12 : __torch__.torch.nn.modules.linear.Identity = prim::GetAttr[name="1"](%pw_conv.5)
      %weight.13 : Tensor = prim::GetAttr[name="weight"](%_0.14)
      %bias.13 : Tensor? = prim::GetAttr[name="bias"](%_0.14)
      %222 : int[] = prim::ListConstruct(%125)
      %223 : int[] = prim::ListConstruct(%120)
      %224 : int[] = prim::ListConstruct(%125)
      %x0.9 : Tensor = aten::conv1d(%result.8, %weight.13, %bias.13, %222, %223, %224, %125) # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/conv.py:303:15
      %proj.4 : __torch__.torch.nn.modules.conv.___torch_mangle_0.Conv1d = prim::GetAttr[name="proj"](%_0.10)
      %weight.15 : Tensor = prim::GetAttr[name="weight"](%proj.4)
      %bias.15 : Tensor? = prim::GetAttr[name="bias"](%proj.4)
      %229 : int[] = prim::ListConstruct(%125)
      %230 : int[] = prim::ListConstruct(%120)
      %231 : int[] = prim::ListConstruct(%125)
      %residual.4 : Tensor = aten::conv1d(%x1.7, %weight.15, %bias.15, %229, %230, %231, %125) # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/conv.py:303:15
      %x1.9 : Tensor = aten::add_(%x0.9, %residual.4, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/number_vad_model.py:110:8
      %activation.2 : __torch__.torch.nn.modules.activation.ReLU = prim::GetAttr[name="activation"](%_0.10)
      %input0.10 : Tensor = aten::relu(%x1.9) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:1457:17
      %training.9 : bool = prim::GetAttr[name="training"](%_1.7)
      %x2.4 : Tensor = aten::dropout(%input0.10, %114, %training.9) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:1252:60
      %encoder.2 : __torch__.torch.nn.modules.container.___torch_mangle_27.Sequential = prim::GetAttr[name="encoder"](%_model.1)
      %_0.16 : __torch__.torch.nn.modules.conv.___torch_mangle_3.Conv1d = prim::GetAttr[name="0"](%encoder.2)
      %_1.14 : __torch__.torch.nn.modules.batchnorm.BatchNorm1d = prim::GetAttr[name="1"](%encoder.2)
      %_3.1 : __torch__.torch.nn.modules.container.___torch_mangle_9.Sequential = prim::GetAttr[name="3"](%encoder.2)
      %_4.1 : __torch__.torch.nn.modules.conv.___torch_mangle_10.Conv1d = prim::GetAttr[name="4"](%encoder.2)
      %_5.1 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_11.BatchNorm1d = prim::GetAttr[name="5"](%encoder.2)
      %_7.1 : __torch__.torch.nn.modules.container.___torch_mangle_17.Sequential = prim::GetAttr[name="7"](%encoder.2)
      %_8.1 : __torch__.torch.nn.modules.conv.___torch_mangle_10.Conv1d = prim::GetAttr[name="8"](%encoder.2)
      %_9.1 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_11.BatchNorm1d = prim::GetAttr[name="9"](%encoder.2)
      %_11.1 : __torch__.torch.nn.modules.container.___torch_mangle_21.Sequential = prim::GetAttr[name="11"](%encoder.2)
      %_12.1 : __torch__.torch.nn.modules.conv.___torch_mangle_22.Conv1d = prim::GetAttr[name="12"](%encoder.2)
      %_13.1 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_23.BatchNorm1d = prim::GetAttr[name="13"](%encoder.2)
      %weight.17 : Tensor = prim::GetAttr[name="weight"](%_0.16)
      %bias.17 : Tensor? = prim::GetAttr[name="bias"](%_0.16)
      %252 : int[] = prim::ListConstruct(%122)
      %253 : int[] = prim::ListConstruct(%120)
      %254 : int[] = prim::ListConstruct(%125)
      %input0.12 : Tensor = aten::conv1d(%x2.4, %weight.17, %bias.17, %252, %253, %254, %125) # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/conv.py:303:15
      %training.11 : bool = prim::GetAttr[name="training"](%_1.14)
       = prim::If(%training.11) # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/batchnorm.py:145:11
        block0():
          %num_batches_tracked.3 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_1.14)
          %258 : Tensor = aten::add_(%num_batches_tracked.3, %125, %125) # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/batchnorm.py:148:16
          -> ()
        block1():
          -> ()
      %training.13 : bool = prim::GetAttr[name="training"](%_1.14)
      %running_mean.3 : Tensor = prim::GetAttr[name="running_mean"](%_1.14)
      %running_var.3 : Tensor = prim::GetAttr[name="running_var"](%_1.14)
      %weight.19 : Tensor = prim::GetAttr[name="weight"](%_1.14)
      %bias.19 : Tensor = prim::GetAttr[name="bias"](%_1.14)
       = prim::If(%training.13) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2435:4
        block0():
          %264 : int[] = aten::size(%input0.12) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2436:27
          %size_prods.3 : int = aten::__getitem__(%264, %120) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2400:17
          %266 : int = aten::len(%264) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2401:19
          %267 : int = aten::sub(%266, %122) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2401:19
          %size_prods0.2 : int = prim::Loop(%267, %117, %size_prods.3) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2401:4
            block0(%i.3 : int, %size_prods0.9 : int):
              %271 : int = aten::add(%i.3, %122) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2402:27
              %272 : int = aten::__getitem__(%264, %271) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2402:22
              %size_prods1.3 : int = aten::mul(%size_prods0.9, %272) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2402:8
              -> (%117, %size_prods1.3)
          %274 : bool = aten::eq(%size_prods0.2, %125) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2403:7
           = prim::If(%274) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2403:4
            block0():
              %275 : str = aten::format(%107, %264) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2404:25
               = prim::RaiseException(%275, %108) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2404:8
              -> ()
            block1():
              -> ()
          -> ()
        block1():
          -> ()
      %input1.7 : Tensor = aten::batch_norm(%input0.12, %weight.19, %bias.19, %running_mean.3, %running_var.3, %training.13, %110, %109, %117) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2438:11
      %input2.2 : Tensor = aten::relu(%input1.7) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:1457:17
      %_0.18 : __torch__.models.number_vad_model.___torch_mangle_8.ConvBlock = prim::GetAttr[name="0"](%_3.1)
      %_1.16 : __torch__.torch.nn.modules.dropout.Dropout = prim::GetAttr[name="1"](%_3.1)
      %pw_conv.7 : __torch__.torch.nn.modules.container.___torch_mangle_7.Sequential = prim::GetAttr[name="pw_conv"](%_0.18)
      %dw_conv.7 : __torch__.torch.nn.modules.container.___torch_mangle_5.Sequential = prim::GetAttr[name="dw_conv"](%_0.18)
      %_0.20 : __torch__.torch.nn.modules.conv.___torch_mangle_4.Conv1d = prim::GetAttr[name="0"](%dw_conv.7)
      %weight.21 : Tensor = prim::GetAttr[name="weight"](%_0.20)
      %bias.21 : Tensor? = prim::GetAttr[name="bias"](%_0.20)
      %285 : int[] = prim::ListConstruct(%125)
      %286 : int[] = prim::ListConstruct(%122)
      %287 : int[] = prim::ListConstruct(%125)
      %input1.9 : Tensor = aten::conv1d(%input2.2, %weight.21, %bias.21, %285, %286, %287, %111) # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/conv.py:303:15
      %result.10 : Tensor = aten::relu(%input1.9) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:1457:17
      %_0.22 : __torch__.torch.nn.modules.conv.___torch_mangle_6.Conv1d = prim::GetAttr[name="0"](%pw_conv.7)
      %weight.25 : Tensor = prim::GetAttr[name="weight"](%_0.22)
      %bias.25 : Tensor? = prim::GetAttr[name="bias"](%_0.22)
      %293 : int[] = prim::ListConstruct(%125)
      %294 : int[] = prim::ListConstruct(%120)
      %295 : int[] = prim::ListConstruct(%125)
      %x0.11 : Tensor = aten::conv1d(%result.10, %weight.25, %bias.25, %293, %294, %295, %125) # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/conv.py:303:15
      %proj.6 : __torch__.torch.nn.modules.conv.___torch_mangle_6.Conv1d = prim::GetAttr[name="proj"](%_0.18)
      %weight.27 : Tensor = prim::GetAttr[name="weight"](%proj.6)
      %bias.27 : Tensor? = prim::GetAttr[name="bias"](%proj.6)
      %300 : int[] = prim::ListConstruct(%125)
      %301 : int[] = prim::ListConstruct(%120)
      %302 : int[] = prim::ListConstruct(%125)
      %residual.6 : Tensor = aten::conv1d(%input2.2, %weight.27, %bias.27, %300, %301, %302, %125) # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/conv.py:303:15
      %x1.11 : Tensor = aten::add_(%x0.11, %residual.6, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/number_vad_model.py:110:8
      %input0.14 : Tensor = aten::relu(%x1.11) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:1457:17
      %training.15 : bool = prim::GetAttr[name="training"](%_1.16)
      %input3.2 : Tensor = aten::dropout(%input0.14, %114, %training.15) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:1252:60
      %weight.29 : Tensor = prim::GetAttr[name="weight"](%_4.1)
      %bias.29 : Tensor? = prim::GetAttr[name="bias"](%_4.1)
      %310 : int[] = prim::ListConstruct(%122)
      %311 : int[] = prim::ListConstruct(%120)
      %312 : int[] = prim::ListConstruct(%125)
      %input4.2 : Tensor = aten::conv1d(%input3.2, %weight.29, %bias.29, %310, %311, %312, %125) # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/conv.py:303:15
      %training.17 : bool = prim::GetAttr[name="training"](%_5.1)
       = prim::If(%training.17) # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/batchnorm.py:145:11
        block0():
          %num_batches_tracked.5 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_5.1)
          %316 : Tensor = aten::add_(%num_batches_tracked.5, %125, %125) # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/batchnorm.py:148:16
          -> ()
        block1():
          -> ()
      %training.19 : bool = prim::GetAttr[name="training"](%_5.1)
      %running_mean.5 : Tensor = prim::GetAttr[name="running_mean"](%_5.1)
      %running_var.5 : Tensor = prim::GetAttr[name="running_var"](%_5.1)
      %weight.31 : Tensor = prim::GetAttr[name="weight"](%_5.1)
      %bias.31 : Tensor = prim::GetAttr[name="bias"](%_5.1)
       = prim::If(%training.19) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2435:4
        block0():
          %322 : int[] = aten::size(%input4.2) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2436:27
          %size_prods.5 : int = aten::__getitem__(%322, %120) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2400:17
          %324 : int = aten::len(%322) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2401:19
          %325 : int = aten::sub(%324, %122) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2401:19
          %size_prods0.11 : int = prim::Loop(%325, %117, %size_prods.5) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2401:4
            block0(%i.5 : int, %size_prods0.13 : int):
              %329 : int = aten::add(%i.5, %122) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2402:27
              %330 : int = aten::__getitem__(%322, %329) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2402:22
              %size_prods1.5 : int = aten::mul(%size_prods0.13, %330) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2402:8
              -> (%117, %size_prods1.5)
          %332 : bool = aten::eq(%size_prods0.11, %125) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2403:7
           = prim::If(%332) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2403:4
            block0():
              %333 : str = aten::format(%107, %322) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2404:25
               = prim::RaiseException(%333, %108) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2404:8
              -> ()
            block1():
              -> ()
          -> ()
        block1():
          -> ()
      %input5.2 : Tensor = aten::batch_norm(%input4.2, %weight.31, %bias.31, %running_mean.5, %running_var.5, %training.19, %110, %109, %117) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2438:11
      %input6.2 : Tensor = aten::relu(%input5.2) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:1457:17
      %_0.24 : __torch__.models.number_vad_model.___torch_mangle_16.ConvBlock = prim::GetAttr[name="0"](%_7.1)
      %_1.18 : __torch__.torch.nn.modules.dropout.Dropout = prim::GetAttr[name="1"](%_7.1)
      %pw_conv.9 : __torch__.torch.nn.modules.container.___torch_mangle_15.Sequential = prim::GetAttr[name="pw_conv"](%_0.24)
      %dw_conv.9 : __torch__.torch.nn.modules.container.___torch_mangle_13.Sequential = prim::GetAttr[name="dw_conv"](%_0.24)
      %_0.26 : __torch__.torch.nn.modules.conv.___torch_mangle_12.Conv1d = prim::GetAttr[name="0"](%dw_conv.9)
      %weight.33 : Tensor = prim::GetAttr[name="weight"](%_0.26)
      %bias.33 : Tensor? = prim::GetAttr[name="bias"](%_0.26)
      %343 : int[] = prim::ListConstruct(%125)
      %344 : int[] = prim::ListConstruct(%122)
      %345 : int[] = prim::ListConstruct(%125)
      %input1.11 : Tensor = aten::conv1d(%input6.2, %weight.33, %bias.33, %343, %344, %345, %112) # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/conv.py:303:15
      %result.12 : Tensor = aten::relu(%input1.11) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:1457:17
      %_0.28 : __torch__.torch.nn.modules.conv.___torch_mangle_14.Conv1d = prim::GetAttr[name="0"](%pw_conv.9)
      %weight.35 : Tensor = prim::GetAttr[name="weight"](%_0.28)
      %bias.35 : Tensor? = prim::GetAttr[name="bias"](%_0.28)
      %351 : int[] = prim::ListConstruct(%125)
      %352 : int[] = prim::ListConstruct(%120)
      %353 : int[] = prim::ListConstruct(%125)
      %x0.13 : Tensor = aten::conv1d(%result.12, %weight.35, %bias.35, %351, %352, %353, %125) # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/conv.py:303:15
      %x1.13 : Tensor = aten::add_(%x0.13, %input6.2, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/number_vad_model.py:110:8
      %input0.16 : Tensor = aten::relu(%x1.13) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:1457:17
      %training.21 : bool = prim::GetAttr[name="training"](%_1.18)
      %input7.2 : Tensor = aten::dropout(%input0.16, %114, %training.21) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:1252:60
      %weight.37 : Tensor = prim::GetAttr[name="weight"](%_8.1)
      %bias.37 : Tensor? = prim::GetAttr[name="bias"](%_8.1)
      %361 : int[] = prim::ListConstruct(%122)
      %362 : int[] = prim::ListConstruct(%120)
      %363 : int[] = prim::ListConstruct(%125)
      %input8.2 : Tensor = aten::conv1d(%input7.2, %weight.37, %bias.37, %361, %362, %363, %125) # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/conv.py:303:15
      %training.23 : bool = prim::GetAttr[name="training"](%_9.1)
       = prim::If(%training.23) # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/batchnorm.py:145:11
        block0():
          %num_batches_tracked.7 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_9.1)
          %367 : Tensor = aten::add_(%num_batches_tracked.7, %125, %125) # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/batchnorm.py:148:16
          -> ()
        block1():
          -> ()
      %training.25 : bool = prim::GetAttr[name="training"](%_9.1)
      %running_mean.7 : Tensor = prim::GetAttr[name="running_mean"](%_9.1)
      %running_var.7 : Tensor = prim::GetAttr[name="running_var"](%_9.1)
      %weight.39 : Tensor = prim::GetAttr[name="weight"](%_9.1)
      %bias.39 : Tensor = prim::GetAttr[name="bias"](%_9.1)
       = prim::If(%training.25) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2435:4
        block0():
          %373 : int[] = aten::size(%input8.2) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2436:27
          %size_prods.7 : int = aten::__getitem__(%373, %120) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2400:17
          %375 : int = aten::len(%373) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2401:19
          %376 : int = aten::sub(%375, %122) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2401:19
          %size_prods0.15 : int = prim::Loop(%376, %117, %size_prods.7) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2401:4
            block0(%i.7 : int, %size_prods0.17 : int):
              %380 : int = aten::add(%i.7, %122) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2402:27
              %381 : int = aten::__getitem__(%373, %380) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2402:22
              %size_prods1.7 : int = aten::mul(%size_prods0.17, %381) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2402:8
              -> (%117, %size_prods1.7)
          %383 : bool = aten::eq(%size_prods0.15, %125) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2403:7
           = prim::If(%383) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2403:4
            block0():
              %384 : str = aten::format(%107, %373) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2404:25
               = prim::RaiseException(%384, %108) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2404:8
              -> ()
            block1():
              -> ()
          -> ()
        block1():
          -> ()
      %input9.2 : Tensor = aten::batch_norm(%input8.2, %weight.39, %bias.39, %running_mean.7, %running_var.7, %training.25, %110, %109, %117) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2438:11
      %input10.2 : Tensor = aten::relu(%input9.2) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:1457:17
      %_0.30 : __torch__.models.number_vad_model.___torch_mangle_20.ConvBlock = prim::GetAttr[name="0"](%_11.1)
      %_1.20 : __torch__.torch.nn.modules.dropout.Dropout = prim::GetAttr[name="1"](%_11.1)
      %pw_conv.11 : __torch__.torch.nn.modules.container.___torch_mangle_19.Sequential = prim::GetAttr[name="pw_conv"](%_0.30)
      %dw_conv.11 : __torch__.torch.nn.modules.container.___torch_mangle_13.Sequential = prim::GetAttr[name="dw_conv"](%_0.30)
      %_0.32 : __torch__.torch.nn.modules.conv.___torch_mangle_12.Conv1d = prim::GetAttr[name="0"](%dw_conv.11)
      %weight.41 : Tensor = prim::GetAttr[name="weight"](%_0.32)
      %bias.41 : Tensor? = prim::GetAttr[name="bias"](%_0.32)
      %394 : int[] = prim::ListConstruct(%125)
      %395 : int[] = prim::ListConstruct(%122)
      %396 : int[] = prim::ListConstruct(%125)
      %input1.13 : Tensor = aten::conv1d(%input10.2, %weight.41, %bias.41, %394, %395, %396, %112) # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/conv.py:303:15
      %result.14 : Tensor = aten::relu(%input1.13) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:1457:17
      %_0.34 : __torch__.torch.nn.modules.conv.___torch_mangle_18.Conv1d = prim::GetAttr[name="0"](%pw_conv.11)
      %weight.43 : Tensor = prim::GetAttr[name="weight"](%_0.34)
      %bias.43 : Tensor? = prim::GetAttr[name="bias"](%_0.34)
      %402 : int[] = prim::ListConstruct(%125)
      %403 : int[] = prim::ListConstruct(%120)
      %404 : int[] = prim::ListConstruct(%125)
      %x0.15 : Tensor = aten::conv1d(%result.14, %weight.43, %bias.43, %402, %403, %404, %125) # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/conv.py:303:15
      %proj.8 : __torch__.torch.nn.modules.conv.___torch_mangle_18.Conv1d = prim::GetAttr[name="proj"](%_0.30)
      %weight.45 : Tensor = prim::GetAttr[name="weight"](%proj.8)
      %bias.45 : Tensor? = prim::GetAttr[name="bias"](%proj.8)
      %409 : int[] = prim::ListConstruct(%125)
      %410 : int[] = prim::ListConstruct(%120)
      %411 : int[] = prim::ListConstruct(%125)
      %residual.8 : Tensor = aten::conv1d(%input10.2, %weight.45, %bias.45, %409, %410, %411, %125) # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/conv.py:303:15
      %x1.10 : Tensor = aten::add_(%x0.15, %residual.8, %125) # /home/keras/notebook/nvme_raid/adamnsandle/silero-models-research/models/number_vad_model.py:110:8
      %input0.18 : Tensor = aten::relu(%x1.10) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:1457:17
      %training.27 : bool = prim::GetAttr[name="training"](%_1.20)
      %input11.2 : Tensor = aten::dropout(%input0.18, %114, %training.27) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:1252:60
      %weight.47 : Tensor = prim::GetAttr[name="weight"](%_12.1)
      %bias.47 : Tensor? = prim::GetAttr[name="bias"](%_12.1)
      %419 : int[] = prim::ListConstruct(%125)
      %420 : int[] = prim::ListConstruct(%120)
      %421 : int[] = prim::ListConstruct(%125)
      %input12.2 : Tensor = aten::conv1d(%input11.2, %weight.47, %bias.47, %419, %420, %421, %125) # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/conv.py:303:15
      %training.29 : bool = prim::GetAttr[name="training"](%_13.1)
       = prim::If(%training.29) # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/batchnorm.py:145:11
        block0():
          %num_batches_tracked.9 : Tensor = prim::GetAttr[name="num_batches_tracked"](%_13.1)
          %425 : Tensor = aten::add_(%num_batches_tracked.9, %125, %125) # /opt/conda/lib/python3.7/site-packages/torch/nn/modules/batchnorm.py:148:16
          -> ()
        block1():
          -> ()
      %training.31 : bool = prim::GetAttr[name="training"](%_13.1)
      %running_mean.9 : Tensor = prim::GetAttr[name="running_mean"](%_13.1)
      %running_var.9 : Tensor = prim::GetAttr[name="running_var"](%_13.1)
      %weight.49 : Tensor = prim::GetAttr[name="weight"](%_13.1)
      %bias.49 : Tensor = prim::GetAttr[name="bias"](%_13.1)
       = prim::If(%training.31) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2435:4
        block0():
          %431 : int[] = aten::size(%input12.2) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2436:27
          %size_prods.9 : int = aten::__getitem__(%431, %120) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2400:17
          %433 : int = aten::len(%431) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2401:19
          %434 : int = aten::sub(%433, %122) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2401:19
          %size_prods0.19 : int = prim::Loop(%434, %117, %size_prods.9) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2401:4
            block0(%i.9 : int, %size_prods0.21 : int):
              %438 : int = aten::add(%i.9, %122) # /opt/conda/lib/python3.7/site-packages/torch/nn/functional.py:2402:27
